const config = require('../config')
const {cmd , commands} = require('../command')
const os = require("os")
const {runtime} = require('../lib/functions')
const axios = require('axios')

cmd({

    pattern: "menu",

    react: "📜",

    alias: ["panel","commands"],

    desc: "Get bot\'s command list.",

    category: "main",

    use: '.menu',

    filename: __filename

},

async(conn, mek, m,{from, l, quoted, body, isCmd, umarmd, args, q, isGroup, sender, senderNumber, botNumber2, botNumber, pushname, isMe, isOwner, groupMetadata, groupName, participants, groupAdmins, isBotAdmins, isAdmins, reply}) => {

try{
let madeMenu = `

👨‍💻 𝚂𝙷𝙰𝙽𝚄𝚆𝙰 𝙼𝙳 𝚆𝙷𝙰𝚃𝚂𝙰𝙿𝙿 𝙱𝙾𝚃 👨‍💻

     *${pushname}*
     
╔══════════════════════════
      *❮ 𝗙𝗨𝗟𝗟 𝗖𝗢𝗠𝗠𝗔𝗡𝗗 𝗟𝗜𝗦𝗧 ❯*
╚══════════════════════════


*╔═〈 ${config.BOT_NAME} 〉═╗*
*║   *❮❮❮❮❮❮❮❮❮❮❯❯❯❯❯❯❯❯❯❯*
*➤❮* *ʀᴜɴᴛɪᴍᴇ* : ${runtime(process.uptime())}❯
*➤❮* *ʀᴀᴍ ᴜsᴇ* : ${(process.memoryUsage().heapUsed / 1024 / 1024).toFixed(2)}MB / ${Math.round(require('os').totalmem / 1024 / 1024)}MB❯
*➤❮* *ɴᴀᴍᴇ ʙᴏᴛ* : *ꜱʜᴀɴᴜᴡᴀ ᴍᴅ*❯
*➤❮* *ᴄʀᴇᴀᴛᴏʀ* : *ꜱʜᴀɴᴜᴡᴀ ɪᴅ*❯
*➤❮* *ᴠᴇʀsɪᴏɴs* : *ᴠ.1.0.0*❯
*➤❮* *ᴍᴇɴᴜ ᴄᴏᴍᴍᴀɴᴅ* : *ᴍᴇɴᴜ ʟɪsᴛ*❯
   ❮*
   ❮❮❮❮❮❮❮❮❮❮❯❯❯❯❯❯❯❯❯❯*


*╭────❒⁠⁠⁠⁠* *📥 DOWNLOADER-CMD 📥* *❒⁠⁠⁠⁠* 
*┋* *.𝙵𝙱*
*┋* *.𝙸𝙽𝚂𝚃𝙰*
*┋* *.𝚅𝙸𝙳𝙴𝙾*
*┋* *.𝙶𝙳𝚁𝙸𝚅𝙴*
*┋* *.𝚃𝚆𝙸𝚃𝚃𝙴𝚁*
*┋* *.𝚃𝚃*
*┋* *.𝙼𝙴𝙳𝙸𝙰𝙵𝙸𝚁𝙴*
*┋* *.𝚂𝙾𝙽𝙶*
*┋* *.𝙿𝙻𝙰𝚈*
*┋* *.𝚅𝙸𝙳𝙴𝙾*
*┋* *.𝙸𝙳𝙴𝙾*
*┋* *.𝙸𝙼𝙶*
*┋* *.𝙰𝙿𝙺*
*┋* *.𝚇 𝚅𝙸𝙳𝙴𝙾*
*┕───────────────────❒*

*╭────❒⁠⁠⁠⁠* *🔎 SEARCH-CMD 🔍* *❒⁠⁠⁠⁠* 
*┋* *.𝚈𝚃𝚂*
*┋* *.𝙻𝙾𝙻𝙸*
*┋* *.𝙸𝙼𝙶*
*┋* *.𝚆𝙴𝙰𝚃𝙷𝙴𝚁*
*┋* *.𝙼𝙾𝚅𝙸𝙴
*┕───────────────────❒*

*╭────❒⁠⁠⁠⁠* *🧠 AI-CMD 🧠* *❒⁠⁠⁠⁠* 
*┋* *.𝙰𝙸*
*┋* *.𝙶𝙿𝚃*
*┕───────────────────❒*

*╭────❒⁠⁠⁠⁠* *👨‍💻 OWNER-CMD 👨‍💻* *❒⁠⁠⁠⁠* 
*┋* *.ᴜᴘᴅᴀᴛᴇᴄᴍᴅ*
*┋* *.ᴏᴡɴᴇʀ*
*┋* *.ʀᴇᴘᴏ*
*┋* *.ꜱʏꜱᴛᴇᴍ*
*┋* *.ꜱᴛᴀᴛᴜꜱ*
*┋* *.ʙʟᴏᴄᴋ*
*┋* *.ᴜɴʙʟᴏᴄᴋ*
*┋* *.sʜᴜᴛᴅᴏᴡɴ*
*┋* *.ᴄʟᴇᴀʀᴄʜᴀᴛs*
*┋* *.sᴇᴛᴘᴘ*
*┋* *.ʙʀᴏᴀᴅᴄᴀsᴛ*
*┋* *.ᴊɪᴅ*
*┋* *.ɢᴊɪᴅ*
*┋* *.ʀᴇꜱᴛᴀʀᴛ*
*┕───────────────────❒*

*╭────❒⁠⁠⁠⁠* *👥 GROUP-CMD 👥* *❒⁠⁠⁠⁠* 
*┋* *.𝚁𝙴𝙼𝙾𝚅𝙴*
*┋* *.𝙳𝙴𝙻𝙴𝚃𝙴*
*┋* *.𝙰𝙳𝙳*
*┋* *.𝙺𝙸𝙲𝙺*
*┋* *.𝚂𝙴𝚃𝙶𝙾𝙾𝙳𝙱𝚈𝙴*
*┋* *.𝚂𝙴𝚃𝚆𝙴𝙻𝙲𝙾𝙼𝙴*
*┋* *.𝙿𝚁𝙾𝙼𝙾𝚃𝙴*
*┋* *.𝙳𝙴𝙼𝙾𝚃𝙴*
*┋* *.𝚃𝙰𝙶𝙰𝙻𝙻*
*┋* *.𝙶𝙴𝚃𝙿𝙸𝙲*
*┋* *.𝙸𝙽𝚅𝙸𝚃𝙴*
*┋* *.𝚁𝙴𝚅𝙾𝙺𝙴*
*┋* *.𝙾𝙸𝙽𝚁𝙴𝚀𝚄𝙴𝚂𝚃𝚂*
*┋* *.𝙰𝙻𝙻𝚁𝙴𝚀*
*┋* *.𝙼𝚄𝚃𝙴*
*┋* *.𝚄𝙽𝙼𝚄𝚃𝙴*
*┋* *.𝙻𝙾𝙲𝙺𝙶𝙲*
*┋* *.𝚄𝙽𝙻𝙾𝙲𝙺𝙶𝙲*
*┋* *.𝙻𝙴𝙰𝚅𝙴*
*┋* *.𝚄𝙿𝙳𝙰𝚃𝙴𝙶𝙽𝙰𝙼𝙴*
*┋* *.𝚄𝙿𝙳𝙰𝚃𝙴𝙶𝙳𝙴𝚂𝙲*
*┋* *.𝙹𝙾𝙸𝙽*
*┋* *.𝙷𝙸𝙳𝙴𝚃𝙰𝙶*
*┋* *.𝙶𝙸𝙽𝙵𝙾*
*┋* *.𝙳𝙸𝚂𝙰𝙿𝙿𝙴𝙰𝚁 𝙾𝙽*
*┋* *.𝙳𝙸𝚂𝙰𝙿𝙿𝙴𝙰𝚁 𝙾𝙵𝙵*
*┋* *.𝙳𝙸𝚂𝙰𝙿𝙿𝙴𝙰𝚁 7𝙳 24𝙷 90𝙳*
*┋* *.𝚂𝙴𝙼𝙳𝙳𝙼*
*┕───────────────────❒*

*╭────❒⁠⁠⁠⁠* *📃 INFO-CMD 📃* *❒⁠⁠⁠⁠* 
*┋* *.ᴍᴇɴᴜ*
*┋* *.ᴍᴇɴᴜ2*
*┋* *.ᴍᴇɴᴜ3*
*┋* *.ᴀʙᴏᴜᴛ*
*┋* *.sᴄʀɪᴘᴛ*
*┋* *.ʀᴇᴘᴏ*
*┋* *.ᴀʟɪᴠᴇ*
*┋* *.ʙᴏᴛɪɴꜰᴏ*
*┋* *.ꜱᴛᴀᴛᴜꜱ*
*┋* *.ꜱᴜᴘᴘᴏʀᴛ*
*┋* *.ᴘɪɴɢ*
*┋* *.ᴘɪɴɢ2*
*┋* *.ꜱʏꜱᴛᴇᴍ*
*┕───────────────────❒*

*╭────❒⁠⁠⁠⁠* *🎡 CONVERTER-CMD 🎡* *❒⁠⁠⁠⁠* 
*┋* *.sᴛɪᴄᴋᴇʀ*
*┕───────────────────❒*

*╭────❒⁠⁠⁠⁠* *⛱️ RANDOM-CMD ⛱️* *❒⁠⁠⁠⁠* 
*┋* *.ᴋɪɴɢ*
*┋* *.ᴅᴏɢ*
*┋* *.ᴀɴɪᴍᴇ*
*┋* *.ᴀɴɪᴍᴇɢɪʀʟ*
*┋* *.ᴀɴɪᴍᴇɢɪʀʟ1*
*┋* *.ᴀɴɪᴍᴇɢɪʀʟ2*
*┋* *.ᴀɴɪᴍᴇɢɪʀʟ3*
*┋* *.ᴀɴɪᴍᴇɢɪʀʟ4*
*┋* *.ᴀɴɪᴍᴇɢɪʀʟ5*
*┕───────────────────❒*

*╭────❒⁠⁠⁠⁠* *🏜️ WALLPAPERS-CMD 🏜️* *❒⁠⁠⁠⁠* 
*┋* *.ɪᴍɢ*
*┕───────────────────❒*

*╭────❒⁠⁠⁠⁠* *🌐 OTHER-CMD 🌐* *❒⁠⁠⁠⁠* 
*┋* *.ᴛʀᴛ*
*┋* *.ᴊᴏᴋᴇ*
*┋* *.ᴍᴏᴠɪᴇ*
*┋* *.ꜰᴀᴄᴛ*
*┋* *.ɢɪᴛʜᴜʙꜱᴛᴀʟᴋ*
*┋* *.ɢᴘᴀꜱꜱ*
*┋* *.ʜᴀᴄᴋ*
*┋* *.ǫᴜᴏᴛᴇ*
*┋* *.ꜱʀᴇᴘᴏ*
*┋* *.ᴅᴇꜰɪɴᴇ*
*┕───────────────────❒*

┏━━━━━━━━━━━━━━━━━━━
*https://whatsapp.com/channel/0029VaHO5B0G3R3cWkZN970s*
┗━━━━━━━━━━━━━━━━━━━


> *2024 ʙᴇᴀᴛ ᴡʜᴀᴛꜱᴀᴘᴘ ʙᴏᴛ*

`

await conn.sendMessage(from,{image:{url:config.ALIVE_IMG},caption:madeMenu},{quoted:mek})

}catch(e){
console.log(e)
reply(`${e}`)
}
})
*┋* *.𝚃𝙰𝙶𝙰𝙻𝙻*
*┋* *.𝙶𝙴𝚃𝙿𝙸𝙲*
*┋* *.𝙸𝙽𝚅𝙸𝚃𝙴*
*┋* *.𝚁𝙴𝚅𝙾𝙺𝙴*
*┋* *.𝙾𝙸𝙽𝚁𝙴𝚀𝚄𝙴𝚂𝚃𝚂*
*┋* *.𝙰𝙻𝙻𝚁𝙴𝚀*
*┋* *.𝙼𝚄𝚃𝙴*
*┋* *.𝚄𝙽𝙼𝚄𝚃𝙴*
*┋* *.𝙻𝙾𝙲𝙺𝙶𝙲*
*┋* *.𝚄𝙽𝙻𝙾𝙲𝙺𝙶𝙲*
*┋* *.𝙻𝙴𝙰𝚅𝙴*
*┋* *.𝚄𝙿𝙳𝙰𝚃𝙴𝙶𝙽𝙰𝙼𝙴*
*┋* *.𝚄𝙿𝙳𝙰𝚃𝙴𝙶𝙳𝙴𝚂𝙲*
*┋* *.𝙹𝙾𝙸𝙽*
*┋* *.𝙷𝙸𝙳𝙴𝚃𝙰𝙶*
*┋* *.𝙶𝙸𝙽𝙵𝙾*
*┋* *.𝙳𝙸𝚂𝙰𝙿𝙿𝙴𝙰𝚁 𝙾𝙽*
*┋* *.𝙳𝙸𝚂𝙰𝙿𝙿𝙴𝙰𝚁 𝙾𝙵𝙵*
*┋* *.𝙳𝙸𝚂𝙰𝙿𝙿𝙴𝙰𝚁 7𝙳 24𝙷 90𝙳*
*┋* *.𝚂𝙴𝙼𝙳𝙳𝙼*
*┕───────────────────❒*

*╭────❒⁠⁠⁠⁠* *📃 𝗜𝗡𝗙𝗢-𝗖𝗢𝗠𝗠𝗔𝗡𝗗 📃* *❒⁠⁠⁠⁠* 
*┋* *.ᴍᴇɴᴜ*
*┋* *.ᴍᴇɴᴜ2*
*┋* *.ᴍᴇɴᴜ3*
*┋* *.ᴀʙᴏᴜᴛ*
*┋* *.sᴄʀɪᴘᴛ*
*┋* *.ʀᴇᴘᴏ*
*┋* *.ᴀʟɪᴠᴇ*
*┋* *.ʙᴏᴛɪɴꜰᴏ*
*┋* *.ꜱᴛᴀᴛᴜꜱ*
*┋* *.ꜱᴜᴘᴘᴏʀᴛ*
*┋* *.ᴘɪɴɢ*
*┋* *.ᴘɪɴɢ2*
*┋* *.ꜱʏꜱᴛᴇᴍ*
*┕───────────────────❒*

*╭────❒⁠⁠⁠⁠* *🎡 CONVERTER-CMD 🎡* *❒⁠⁠⁠⁠* 
*┋* *.sᴛɪᴄᴋᴇʀ*
*┕───────────────────❒*

*╭────❒⁠⁠⁠⁠* *⛱️ RANDOM-CMD ⛱️* *❒⁠⁠⁠⁠* 
*┋* *.ᴋɪɴɢ*
*┋* *.ᴅᴏɢ*
*┋* *.ᴀɴɪᴍᴇ*
*┋* *.ᴀɴɪᴍᴇɢɪʀʟ*
*┋* *.ᴀɴɪᴍᴇɢɪʀʟ1*
*┋* *.ᴀɴɪᴍᴇɢɪʀʟ2*
*┋* *.ᴀɴɪᴍᴇɢɪʀʟ3*
*┋* *.ᴀɴɪᴍᴇɢɪʀʟ4*
*┋* *.ᴀɴɪᴍᴇɢɪʀʟ5*
*┕───────────────────❒*

*╭────❒⁠⁠⁠⁠* *🏜️ WALLPAPERS-CMD 🏜️* *❒⁠⁠⁠⁠* 
*┋* *.ɪᴍɢ*
*┕───────────────────❒*

*╭────❒⁠⁠⁠⁠* *🌐 OTHER-CMD 🌐* *❒⁠⁠⁠⁠* 
*┋* *.ᴛʀᴛ*
*┋* *.ᴊᴏᴋᴇ*
*┋* *.ᴍᴏᴠɪᴇ*
*┋* *.ꜰᴀᴄᴛ*
*┋* *.ɢɪᴛʜᴜʙꜱᴛᴀʟᴋ*
*┋* *.ɢᴘᴀꜱꜱ*
*┋* *.ʜᴀᴄᴋ*
*┋* *.ǫᴜᴏᴛᴇ*
*┋* *.ꜱʀᴇᴘᴏ*
*┋* *.ᴅᴇꜰɪɴᴇ*
*┕───────────────────❒*⁠

┏━━━━━━━━━━━━━━━━━━━
*https://whatsapp.com/channel/0029ValzLhUBqbrFa8tMPg3U*
┗━━━━━━━━━━━━━━━━━━━


> *2024 ʙᴇꜱᴛ ᴡʜᴀᴛꜱᴀᴘᴘ ʙᴏᴛ*
╘✦•·········•••••••••············•✦ 
`

await conn.sendMessage(from,{image:{url:config.ALIVE_IMG},caption:madeMenu},{quoted:mek})

}catch(e){
console.log(e)
reply(`${e}`)
}
})
*┋* *.sᴇᴛɢᴏᴏᴅʙʏᴇ <ᴛᴇxᴛ>*
*┋* *.sᴇᴛᴡᴇʟᴄᴏᴍᴇ <ᴛᴇxᴛ>*
*┋* *.ᴘʀᴏᴍᴏᴛᴇ*
*┋* *.ᴅᴇᴍᴏᴛᴇ*
*┋* *.ᴛᴀɢᴀʟʟ*
*┋* *.ɢᴇᴛᴘɪᴄ*
*┋* *.ɪɴᴠɪᴛᴇ*
*┋* *.ʀᴇᴠᴏᴋᴇ*
*┋* *.ᴊᴏɪɴʀᴇǫᴜᴇsᴛs*
*┋* *.ᴀʟʟʀᴇǫ*
*┋* *.ᴍᴜᴛᴇ*
*┋* *.ᴜɴᴍᴜᴛᴇ*
*┋* *.ʟᴏᴄᴋɢᴄ*
*┋* *.ᴜɴʟᴏᴄᴋɢᴄ*
*┋* *.ʟᴇᴀᴠᴇ*
*┋* *.ᴜᴘᴅᴀᴛᴇɢɴᴀᴍᴇ*
*┋* *.ᴜᴘᴅᴀᴛᴇɢᴅᴇsᴄ*
*┋* *.ᴊᴏɪɴ*
*┋* *.ʜɪᴅᴇᴛᴀɢ*
*┋* *.ɢɪɴғᴏ*
*┋* *.ᴅɪsᴀᴘᴘᴇᴀʀ ᴏɴ*
*┋* *.ᴅɪsᴀᴘᴘᴇᴀʀ ᴏғғ*
*┋* *.ᴅɪsᴀᴘᴘᴇᴀʀ 7ᴅ 24ʜ 90ᴅ*
*┋* *.sᴇɴᴅᴅᴍ*
*┕───────────────────❒*

*╭────❒⁠⁠⁠⁠* *📃 INFO-CMD 📃* *❒⁠⁠⁠⁠* 
*┋* *.ᴍᴇɴᴜ*
*┋* *.ᴍᴇɴᴜ2*
*┋* *.ᴍᴇɴᴜ3*
*┋* *.ᴀʙᴏᴜᴛ*
*┋* *.sᴄʀɪᴘᴛ*
*┋* *.ʀᴇᴘᴏ*
*┋* *.ᴀʟɪᴠᴇ*
*┋* *.ʙᴏᴛɪɴꜰᴏ*
*┋* *.ꜱᴛᴀᴛᴜꜱ*
*┋* *.ꜱᴜᴘᴘᴏʀᴛ*
*┋* *.ᴘɪɴɢ*
*┋* *.ᴘɪɴɢ2*
*┋* *.ꜱʏꜱᴛᴇᴍ*
*┕───────────────────❒*

*╭────❒⁠⁠⁠⁠* *🎡 CONVERTER-CMD 🎡* *❒⁠⁠⁠⁠* 
*┋* *.sᴛɪᴄᴋᴇʀ*
*┕───────────────────❒*

*╭────❒⁠⁠⁠⁠* *⛱️ RANDOM-CMD ⛱️* *❒⁠⁠⁠⁠* 
*┋* *.ᴋɪɴɢ*
*┋* *.ᴅᴏɢ*
*┋* *.ᴀɴɪᴍᴇ*
*┋* *.ᴀɴɪᴍᴇɢɪʀʟ*
*┋* *.ᴀɴɪᴍᴇɢɪʀʟ1*
*┋* *.ᴀɴɪᴍᴇɢɪʀʟ2*
*┋* *.ᴀɴɪᴍᴇɢɪʀʟ3*
*┋* *.ᴀɴɪᴍᴇɢɪʀʟ4*
*┋* *.ᴀɴɪᴍᴇɢɪʀʟ5*
*┕───────────────────❒*

*╭────❒⁠⁠⁠⁠* *🏜️ WALLPAPERS-CMD 🏜️* *❒⁠⁠⁠⁠* 
*┋* *.ɪᴍɢ*
*┕───────────────────❒*

*╭────❒⁠⁠⁠⁠* *🌐 OTHER-CMD 🌐* *❒⁠⁠⁠⁠* 
*┋* *.ᴛʀᴛ*
*┋* *.ᴊᴏᴋᴇ*
*┋* *.ᴍᴏᴠɪᴇ*
*┋* *.ꜰᴀᴄᴛ*
*┋* *.ɢɪᴛʜᴜʙꜱᴛᴀʟᴋ*
*┋* *.ɢᴘᴀꜱꜱ*
*┋* *.ʜᴀᴄᴋ*
*┋* *.ǫᴜᴏᴛᴇ*
*┋* *.ꜱʀᴇᴘᴏ*
*┋* *.ᴅᴇꜰɪɴᴇ*
*┕───────────────────❒*

┏━━━━━━━━━━━━━━━━━━━
*https://whatsapp.com/channel/0029VaHO5B0G3R3cWkZN970s*
┗━━━━━━━━━━━━━━━━━━━


> *2024 ʙᴇꜱᴛ ᴡʜᴀᴛꜱᴀᴘᴘ ʙᴏᴛ*
`

await conn.sendMessage(from,{image:{url:config.ALIVE_IMG},caption:madeMenu},{quoted:mek})

}catch(e){
console.log(e)
reply(`${e}`)
}
})
